<?php

return [
    'system' => [
        /* 用户默认跳转地址
         * ---------------------------------------- */
        'user_location'         => '/login',

        /*
        |--------------------------------------------------------------------------
        | 跨域来源
        |--------------------------------------------------------------------------
        |
        */
        'cross_origin'          => '*',

        /*
        |--------------------------------------------------------------------------
        | 单点登录
        |--------------------------------------------------------------------------
        */
        'sso_group'             => [
        ],

        /*
        |--------------------------------------------------------------------------
        | 允许的Header
        |--------------------------------------------------------------------------
        |
        */
        'cross_headers'         => [
            // sentry
            'sentry-trace',
            // app
            'x-app', 'x-app-host', 'x-app-sign',
            // common software
            'x-os', 'x-ver', 'x-id', 'x-type',
            // system
            'x-sys-name', 'x-sys-version', 'x-sys-device', 'x-sys-cpu', 'x-sys-network',
            // append
            'x-k1', 'x-k2', 'x-k3', 'x-k4', 'x-k5',
            'x-k6', 'x-k7', 'x-k8', 'x-k9', 'x-k10',
        ],

        /*
        |--------------------------------------------------------------------------
        | 接口debug key, 当 _py_secret 和此值相等, 则不进行加密的签名验证
        |--------------------------------------------------------------------------
        |
        */
        'secret'                => env('PY_SECRET', ''),

        /* 用户模块类型映射
         * ---------------------------------------- */
        'role_type_map'         => [
            'desktop' => 'backend',
            'front'   => 'user',
        ],

        /*
        |--------------------------------------------------------------------------
        | 上传图片的限制, 为了方便删除, 也是为了限制大小
        |--------------------------------------------------------------------------
        */
        'upload_image_district' => [
            'testing' => 1428,
        ],
    ],

    'core' => [
        'op_mail' => 'zhaody901@126.com',

        /*
        |--------------------------------------------------------------------------
        | 接口文档的定义
        |--------------------------------------------------------------------------
        | 需要运行 `php artisan py-core:doc api` 来生成技术文档
        */
        'apidoc'  => [
            'web' => [
                // 标题
                'title'       => '用户接口',
                // 默认访问地址
                'default_url' => 'api_v1/system/auth/login',

                'method' => 'post',

                'sign_token' => true,
                'match'      => 'api.*/web|ApiWeb|api/web|ApiV1',
            ],
        ],
    ],

    'framework' => [
        /*
        |--------------------------------------------------------------------------
        | Seo 相关
        |--------------------------------------------------------------------------
        |
        */
        'title' => '网站名称',

        'description' => '网站描述',
    ],

    'sms'          => [
        'sign'  => '氪金兽',

        /* 短信类型
         * ---------------------------------------- */
        'types' => [
            [
                'type'  => 'captcha',
                'title' => '验证码(:code)',
            ],
            [
                'type'  => 'captcha1',
                'title' => '验证码1(:code)',
            ],
            [
                'type'  => 'captcha2',
                'title' => '验证码2(:code)',
            ],
            [
                'type'  => 'captcha3',
                'title' => '验证码3(:code)',
            ],
            [
                'type'  => 'captcha4',
                'title' => '验证码4(:code)',
            ],
            [
                'type'  => 'captcha5',
                'title' => '验证码5(:code)',
            ],
            [
                'type'  => 'captcha6',
                'title' => '验证码6(:code)',
            ],
            [
                'type'  => 'captcha7',
                'title' => '验证码7(:code)',
            ],
            [
                'type'  => 'captcha8',
                'title' => '验证码8(:code)',
            ],
            [
                'type'  => 'captcha9',
                'title' => '验证码9(:code)',
            ],
            [
                'type'  => 'captcha-cty',
                'title' => '国际验证码(:code)',
            ],
            [
                'type'  => 'handle',
                'title' => '接单成功通知',
            ],
        ],
    ],
    'mgr-page'     => [
        'captcha_login' => env('PY_MGR_CAPTCHA_LOGIN', false),
        'account_login' => env('PY_MGR_ACCOUNT_LOGIN', false),
    ],
    'ext-ip_store' => [
        /*
         * ---------------------------------------- */
        'type' => '17mon',
    ],
    'category'     => [
        /* 分类类型
        * ---------------------------------------- */
        'types' => [
            [
                'type'  => 'steam-pubg',
                'title' => 'STEAM(Pubg)',
            ],
        ],
    ],
];
